export const schedules = {
  "2025-09-05": [
    { id: "1", title: "Digital Insight 2 서비스 개발을 위한 DevOps Tools" },
  ],
  "2025-09-12": [
    { id: "1", title: "1차 사후평가" },
    { id: "2", title: "2차 사전평가" },
  ],
  "2025-09-15": [
    { id: "1", title: "미니PJT-1" },
  ],
  "2025-09-16": [
    { id: "1", title: "미니PJT-1" },
  ],
  "2025-09-17": [
    { id: "1", title: "미니PJT-1" },
  ],
  "2025-09-18": [
    { id: "1", title: "미니PJT-1" },
  ],
  "2025-09-19": [
    { id: "1", title: "미니PJT-1" },
  ],

  "2025-10-03": [
    { id: "1", title: "개천절" },
  ],
  "2025-10-06": [
    { id: "1", title: "추석 연휴" },
  ],
  "2025-10-07": [
    { id: "1", title: "추석 연휴" },
  ],
  "2025-10-08": [
    { id: "1", title: "추석 연휴" },
  ],
  "2025-10-09": [
    { id: "1", title: "한글날" },
  ],
  "2025-10-10": [
    { id: "1", title: "휴강" },
  ],
  "2025-10-22": [
    { id: "1", title: "2차 사후평가" },
  ],
  "2025-10-23": [
    { id: "1", title: "미니 PJT-2" },
  ],
  "2025-10-24": [
    { id: "1", title: "미니 PJT-2" },
  ],
  "2025-10-27": [
    { id: "1", title: "미니 PJT-2" },
  ],
  "2025-10-28": [
    { id: "1", title: "미니 PJT-2" },
  ],
  "2025-10-29": [
    { id: "1", title: "미니 PJT-2" },
  ],
  "2025-10-30": [
    { id: "1", title: "휴강(오프라인 준비)" },
  ],
  "2025-10-31": [
    { id: "1", title: "휴강(오프라인 준비)" },
  ],

  "2025-11-03": [
    { id: "1", title: "해커톤" },
  ],
  "2025-11-04": [
    { id: "1", title: "해커톤" },
  ],
  "2025-11-05": [
    { id: "1", title: "Digital Insight 3 CNS AM Agile" },
  ],
  "2025-11-06": [
    { id: "1", title: "Digital Insight 3 CNS AM Agile" },
  ],
  "2025-11-07": [
    { id: "1", title: "최종 PJT(프로젝트 워크샵)" },
  ],
  "2025-11-08": [
    { id: "1", title: "멘토링" },
  ],
  "2025-11-10": [
    { id: "1", title: "휴강" },
  ],
  "2025-11-11": [
    { id: "1", title: "최종 PJT" },
  ],
  "2025-11-12": [
    { id: "1", title: "최종 PJT" },
  ],
  "2025-11-13": [
    { id: "1", title: "최종 PJT" },
  ],
  "2025-11-14": [
    { id: "1", title: "최종 PJT" },
  ],
  "2025-11-15": [
    { id: "1", title: "멘토링" },
  ],
  "2025-11-17": [
    { id: "1", title: "휴강" },
  ],
  "2025-11-18": [
    { id: "1", title: "최종 PJT" },
  ],
  "2025-11-19": [
    { id: "1", title: "최종 PJT" },
  ],
  "2025-11-20": [
    { id: "1", title: "최종 PJT" },
  ],
  "2025-11-21": [
    { id: "1", title: "최종 PJT" },
  ],
  "2025-11-22": [
    { id: "1", title: "멘토링" },
  ],
  "2025-11-24": [
    { id: "1", title: "휴강" },
  ],
  "2025-11-25": [
    { id: "1", title: "최종 PJT" },
  ],
  "2025-11-26": [
    { id: "1", title: "최종 PJT" },
  ],
  "2025-11-27": [
    { id: "1", title: "최종 PJT" },
  ],
  "2025-11-28": [
    { id: "1", title: "최종 PJT" },
  ],

  "2025-12-01": [
    { id: "1", title: "휴강" },
  ],
  "2025-12-02": [
    { id: "1", title: "최종 PJT" },
  ],
  "2025-12-03": [
    { id: "1", title: "최종 PJT" },
  ],
  "2025-12-04": [
    { id: "1", title: "최종 PJT" },
  ],
  "2025-12-05": [
    { id: "1", title: "최종 PJT" },
  ],
  "2025-12-06": [
    { id: "1", title: "멘토링" },
  ],
  "2025-12-08": [
    { id: "1", title: "휴강" },
  ],
  "2025-12-09": [
    { id: "1", title: "최종 PJT" },
  ],
  "2025-12-10": [
    { id: "1", title: "최종 PJT" },
  ],
  "2025-12-11": [
    { id: "1", title: "최종 PJT" },
  ],
  "2025-12-12": [
    { id: "1", title: "최종 PJT" },
  ],
  "2025-12-15": [
    { id: "1", title: "휴강" },
  ],
  "2025-12-16": [
    { id: "1", title: "최종 PJT" },
  ],
  "2025-12-17": [
    { id: "1", title: "최종 PJT" },
  ],
  "2025-12-18": [
    { id: "1", title: "최종 PJT" },
  ],
  "2025-12-19": [
    { id: "1", title: "최종 PJT" },
  ],
  "2025-12-20": [
    { id: "1", title: "[중간발표] 멘토링" },
  ],
  "2025-12-22": [
    { id: "1", title: "휴강" },
  ],
  "2025-12-23": [
    { id: "1", title: "최종 PJT" },
  ],
  "2025-12-24": [
    { id: "1", title: "최종 PJT" },
  ],
  "2025-12-25": [
    { id: "1", title: "크리스마스" },
  ],
  "2025-12-26": [
    { id: "1", title: "최종 PJT" },
  ],
  "2025-12-27": [
    { id: "1", title: "멘토링" },
  ],
  "2025-12-29": [
    { id: "1", title: "휴강" },
  ],
  "2025-12-30": [
    { id: "1", title: "최종 PJT" },
  ],
  "2025-12-31": [
    { id: "1", title: "최종 PJT" },
  ],

  "2026-01-01": [
    { id: "1", title: "신정" },
  ],
  "2026-01-02": [
    { id: "1", title: "휴강" },
  ],
  "2026-01-05": [
    { id: "1", title: "최종 PJT" },
  ],
  "2026-01-06": [
    { id: "1", title: "최종 PJT" },
  ],
  "2026-01-07": [
    { id: "1", title: "최종 PJT" },
  ],
  "2026-01-08": [
    { id: "1", title: "최종 PJT" },
  ],
  "2026-01-09": [
    { id: "1", title: "최종 PJT" },
  ],
  "2026-01-10": [
    { id: "1", title: "멘토링" },
  ],
  "2026-01-12": [
    { id: "1", title: "휴강" },
  ],
  "2026-01-13": [
    { id: "1", title: "최종 PJT" },
  ],
  "2026-01-15": [
    { id: "1", title: "최종 PJT" },
  ],
  "2026-01-16": [
    { id: "1", title: "최종 PJT" },
  ],
  "2026-01-19": [
    { id: "1", title: "최종 PJT" },
  ],
  "2026-01-20": [
    { id: "1", title: "최종 PJT" },
  ],
  "2026-01-21": [
    { id: "1", title: "최종 PJT" },
  ],
  "2026-01-22": [
    { id: "1", title: "채용 특강 & Meet up Day" },
  ],
  "2026-01-23": [
    { id: "1", title: "발표회 & 수료식" },
  ]




};

// Date 객체 → YYYY-MM-DD 문자열
export const toISODate = (d) =>
  `${d.getFullYear()}-${String(d.getMonth() + 1).padStart(2, "0")}-${String(
    d.getDate()
  ).padStart(2, "0")}`;